In [2]:
# 빅데이터 분석기사 실기 3회 1유형

# 1-1 캘리포니아 집값 데이터
# 결측치를 포함하는 모든 행을 제거한 후 , 처음 부터 순서대로 70%를 추출하여, 'housing_median_age'컬럼의 사분위수 Q1의 값을 구하시오.

#주의사항 :  정답 제출시 정수형으로 제출

In [1]:
import pandas as pd
df = pd.read_csv('https://raw.githubusercontent.com/Soyoung-Yoon/bigdata/main/housing03.csv')
df.head()
df.shape

(20640, 10)

In [2]:
df = df.dropna(how='any',axis=0)
df.shape

(20433, 10)

In [3]:
df2 = df.iloc[:14304, :]
df2

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value,ocean_proximity
0,-122.23,37.88,41.0,880.0,129.0,322.0,126.0,8.3252,452600.0,NEAR BAY
1,-122.22,37.86,21.0,7099.0,1106.0,2401.0,1138.0,8.3014,358500.0,NEAR BAY
2,-122.24,37.85,52.0,1467.0,190.0,496.0,177.0,7.2574,352100.0,NEAR BAY
3,-122.25,37.85,52.0,1274.0,235.0,558.0,219.0,5.6431,341300.0,NEAR BAY
4,-122.25,37.85,52.0,1627.0,280.0,565.0,259.0,3.8462,342200.0,NEAR BAY
...,...,...,...,...,...,...,...,...,...,...
14437,-117.24,32.80,18.0,2205.0,661.0,874.0,580.0,3.8018,112500.0,NEAR OCEAN
14438,-117.24,32.80,19.0,1863.0,497.0,868.0,503.0,2.2880,210000.0,NEAR OCEAN
14439,-117.24,32.80,30.0,1917.0,462.0,828.0,437.0,2.4671,276300.0,NEAR OCEAN
14440,-117.24,32.80,29.0,3376.0,882.0,1513.0,843.0,3.1010,238200.0,NEAR OCEAN
14441,-117.25,32.81,32.0,2402.0,551.0,1020.0,532.0,3.3942,307400.0,NEAR OCEAN

In [4]:
q1 = df2['housing_median_age'].quantile(0.25)
print(q1)

19.0

In [6]:
# 1-2 연도별 나라별 유병률 데이터

# 2000년 데이터에 대해 국가 전체 유병률 평균값보다 큰값을 가진 국가 개수는?
# (year변수와 국가들의 결핵 유병률 값을 가진 데이터셋이 주어짐)

In [22]:
import pandas as pd

df = pd.read_csv('https://raw.githubusercontent.com/Soyoung-Yoon/bigdata/main/worlddata.csv')

df = df.set_index('year')
df = df.T

In [33]:
df.shape

(193, 4)

In [23]:
df.head()

year          1999   2000   2001  2002
Afghanistan    0.0    0.0    0.0   0.0
Albania       89.0  132.0   54.0   4.9
Algeria       25.0    0.0   14.0   0.7
Andorra      245.0  138.0  312.0  12.4
Angola       217.0   57.0   45.0   5.9

In [28]:
mean_2000 = (df.iloc[:,1].sum()) / 193
mean_2000

81.01036269430051

In [36]:
answer = df[(df[2000] > mean_2000 )]
print(answer)

year                   1999   2000   2001  2002
Albania                89.0  132.0   54.0   4.9
Andorra               245.0  138.0  312.0  12.4
Antigua & Barbuda     102.0  128.0   45.0   4.9
Armenia                21.0  179.0   11.0   3.8
Bahamas               122.0  176.0   51.0   6.3
...                     ...    ...    ...   ...
United Arab Emirates   16.0  135.0    5.0   2.8
United Kingdom        219.0  126.0  195.0  10.4
USA                   249.0  158.0   84.0   8.7
Uzbekistan             25.0  101.0    8.0   2.4
Venezuela             333.0  100.0    3.0   7.7

[76 rows x 4 columns]

In [8]:
# 1-3 타이타닉 데이터

# 각 열의 결측치 비율을 확인한후, 결측치의 비율이 가장 높은 변수명을 구하시오.

import pandas as pd
df = pd.read_csv('https://raw.githubusercontent.com/Soyoung-Yoon/bigdata/main/titanic_train03.csv')
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,C85,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,C123,S